Repository: mishin/perldoc-ru
Catalog: pod2-ru/omegat/project_save.tmx
Source language: en_us
Languages: ru_ru

source: != inequality
ru_ru: != неравенство

source: "@INC" locations of perl libraries
ru_ru: "@INC" место расположение Perl библиотек

source: "Hello, world"
ru_ru: "Привет, мир!"

source: # Bourne shell syntax
ru_ru: # Синтаксис оболочки (Bourne shell syntax)

source: # If you have "env" utility
ru_ru: # Если у вас есть утилита "env"

source: # This is a comment
ru_ru: # Это комментарий

source: # This loop reads from STDIN, and prints non-blank lines:
ru_ru: # Этот цикл читает со стандартного ввода и печатает без пустых строк:

source: # This section is parsed by Porting/pod_lib.pl for use by pod/buildtoc etc
ru_ru: # Этот раздел парсится Porting/pod_lib.pl для использования pod/buildtoc и т.д.

source: # a cheap and nasty way to break an email address up into parts
ru_ru: # дешевая и противная способ разорвать адрес электронной почты на части

source: # csh syntax
ru_ru: # синтаксис csh

source: # in $a
ru_ru: # в $a

source: # the Perlish post-condition way
ru_ru: # Perlish постусловный путь

source: # the traditional way
ru_ru: # Традиционным способом

source: # this would print with a linebreak in the middle
ru_ru: # это будет печатать с переносом строки по середине

source: # you don't have to use the default $_ either...
ru_ru: # вы не обязаны использовать переменную по умолчанию $ _ либо ...

source: #!/usr/bin/perl -spi.orig # same as -s -p -i.orig
ru_ru: #!/usr/bin/perl -spi.orig # то же самое -s -p -i.orig

source: $ end of string
ru_ru: $ конец строки

source: $ echo "compression-vars: " `perl -V:z.*: ` " are here !"
ru_ru: $ echo "сжатые-переменные: " `perl -V:z.*: ` " уже здесь !"

source: $ perl -p -i'/some/file/path/*' -e 1 file1 file2 file3... or
ru_ru: $ perl -p -i'/some/file/path/*' -e 1 file1 file2 file3... или

source: $ perl -pi -e 's/bar/baz/' fileA # overwrite current file
ru_ru: $ perl -pi -e 's/bar/baz/' fileA # перезаписать текущий файл

source: $ perl -pi'*' -e 's/bar/baz/' fileA # overwrite current file
ru_ru: $ perl -pi'*' -e 's/bar/baz/' fileA # перезаписать текущий файл

source: $ perl -pi'old/*.orig' -e 's/bar/baz/' fileA # backup to
ru_ru: $ perl -pi'old/*.orig' -e 's/bar/baz/' fileA # делает бекап (backup to)

source: $ perl -pi'orig_*' -e 's/bar/baz/' fileA # backup to
ru_ru: $ perl -pi'orig_*' -e 's/bar/baz/' fileA # резервирует файл в (backup to)

source: $a += 1; # same as $a = $a + 1
ru_ru: $a += 1; # также как $a = $a + 1

source: $a -= 1; # same as $a = $a - 1
ru_ru: $a -= 1; # также как $a = $a - 1

# $a .= " "; # same as $a = $a .
source: $a .= "\n"; # same as $a = $a .
ru_ru: $a .= "\n"; # также как $a = $a .

source: $a =~ s/foo/bar/; # replaces foo with bar in $a
ru_ru: $a =~ s/foo/bar/; # заменяет foo с bar в $a

source: $a =~ s/foo/bar/g; # replaces ALL INSTANCES of foo with bar
ru_ru: $a =~ s/foo/bar/g; # заменены ВСЕ ЭКЗЕМПЛЯРЫ foo с bar

source: $fruit_color{"apple"}; # gives "red"
ru_ru: $fruit_color{"apple"}; # дает "red"

source: && and
ru_ru: && и

source: (An interactive Perl environment is also possible--see L<perldebug> for details on how to do that.) Upon startup, Perl looks for your program in one of the following places:
ru_ru: (Интерактивная среда Perl также возможна - см. L<perldebug> для деталей о том, как это сделать) После запуска Perl ищет вашу программу в одном из следующих мест:

source: (C<MANPAGER> is not used if C<perldoc> was told to display plain text or unformatted pod.)
ru_ru: (C<MANPAGER> не используется, если C<perldoc> указывает отображать простой текст или неформатированный pod.)

source: (C<and>, C<or> and C<not> aren't just in the above table as descriptions of the operators.
ru_ru: (C<and>, C<or> и C<not> не только в приведенной выше таблице, также смотри описания операторов.

source: (In Perls earlier than 5.8.1 the B<-C> switch was a Win32-only switch that enabled the use of Unicode-aware "wide system call" Win32 APIs.
ru_ru: (В Perl раньше, чем 5.8.1 B<-C> переключатель был только Win32-переключатель, который включен использование юникодовых "широкий системный вызов" Win32 API.

source: (In a script passed to Perl via B<-e> switches, each B<-e> is counted as one line.)
ru_ru: (В скрипте Perl передается через B<-e> ключи, каждый B<-e> считается одной линией.)

source: (In addition, if running under HP-UX, C<col -x> will be used.) This is primarily used for the documentation for the perl library modules.
ru_ru: (а также C<col -x> для ОС HP-UX). В основном используется для получения документации по модулям Perl.

source: (In this case you would indicate the end of the program using the C<__END__> token.)
ru_ru: (В этом случае вы можете обозначить конец программы с помощью маркера C<__END__.)

source: (It currently does I<not> mimic MS-DOS as far as treating of Control-Z as being an end-of-file marker.)
ru_ru: (В настоящее время она I<не> имитировать MS-DOS, насколько лечении Control-Z как конец файла маркер.)

source: (Note that systems supporting the C<#!> notation invoke interpreters this way.
ru_ru: (Заметим, что системы, поддерживающие нотацию C<#!> вызывают интерпретатор, используя путь, стоящий за C<#!>.

source: (See L<perl581delta/UTF-8 no longer default under UTF-8 locales>.)
ru_ru: ((См. L<perl581delta/UTF-8 больше не является поведением по умолчанию под локалями UTF-8>.)

source: (See L<perlsyn/"Plain Old Comments (Not!)">)
ru_ru: (См. L<perlsyn/"Plain Old Comments (Not!)">)

source: (Since Perl 5.18.0) Set to C<"0"> or C<"NO"> then traversing keys will be repeatable from run to run for the same PERL_HASH_SEED.
ru_ru: (Так как Perl 5.18.0) Установите в C<"0"> или C<"NO"> Затем клавишами перемещения будет повторяемые от запуска к запуску по той же PERL_HASH_SEED.

source: (Since Perl 5.8.1, new semantics in Perl 5.18.0) Used to override the randomization of Perl's internal hash function.
ru_ru: (Так как Perl 5.8.1, новой семантике Perl 5.18.0) Используется для переопределения рандомизации внутренней хэш-функции Perl.

source: (Since Perl 5.8.1.) Set to C<"1"> to display (to STDERR) information about the hash function, seed, and what type of key traversal randomization is in effect at the beginning of execution.
ru_ru: (Так как Perl 5.8.1.) Установите в C<"1"> для отображения (на стандартный вывод ошибок STDERR) информации о хэш-функция, семена, и какой тип ключевых рандомизации обхода в силу в начале исполнения.

source: (So if C<textsize> expects an integer, and you do C<-w textsize:big>, expect trouble.)
ru_ru: (Так если C<textsize> ожидает целочисленное значение и передана строка C<-w textsize:big>, то будут проблемы).

source: (Still, a "hello world" executable comes out to about 200K on my machine.) If you want to execute a portion of your program before dumping, use the dump() operator instead.
ru_ru: (Тем не менее, "привет мир" исполняемый файл выходит около 200K на моей машине.) Если вы хотите, чтобы выполнить часть вашей программы перед дампом, используйте вместо этого оператор dump().

source: (The latter is so that embedded pods for executables, such as C<perldoc> itself, are available.)
ru_ru: (Последнее таково, что встроенная POD-документация для исполняемых файлов, таких как сам C<perldoc>, доступна.)

source: (These typically would be for older compatible perl versions installed in the same directory tree.)
ru_ru: (Они обычно были бы для старой совместимости Perl версии устанавливаются в том же дереве каталогов.)

source: (This doesn't apply to sysread() and syswrite().)
ru_ru: (Это не относится к sysread() и syswrite().)

source: (This is one of the requirements of C<use strict;>.)
ru_ru: (Это одно из требований C<use strict;> ).

source: (This is unlike the typical shell script, which might run part-way through before finding a syntax error.)
ru_ru: (Это не похоже на типичный сценарий оболочки, который может выполнить часть сценария, прежде чем найдет синтаксические ошибки.)

source: (This means that you cannot use the B<-x> option with a directory name that consists of hexadecimal digits, or else Perl will think you have specified a hex number to B<-0>.)
ru_ru: (Это означает, что вы не можете использовать опцию B<-x> с именем каталога, который состоит из шестнадцатеричных цифр, иначе Perl подумает, что вы указали шестнадцатеричное число B<-0>.)

source: (This start line assumes you have the B<env> program.
ru_ru: (Это первая строка подразумевает, что у вас есть программа B<env>.

source: (This works only if debugging is compiled into your Perl.) Another nice value is B<-Dx>, which lists your compiled syntax tree.
ru_ru: (Это работает только тогда, когда отладка скомпилирована в Perl.) Еще одно приятное значение B<-Dx>, в котором перечислены списки вышего скомпилированного синтаксического дерева.

source: (Why do we have separate numeric and string comparisons?
ru_ru: (Почему у нас есть отдельные числовые и строковые сравнения?

source: (foo|bar|baz) matches any of the alternatives specified
ru_ru: (foo|bar|baz) соответствует любому из указанных альтернатив

source: (mnemonic: PATH separator ":".)
ru_ru: (мнемоника: разделитель (separator) PATH ":".)

source: (mnemonic: empty label)
ru_ru: (мнемоника: пустые метки)

source: (the LC_ALL, LC_TYPE, and LANG, in the order of
ru_ru: (LC_ALL, LC_TYPE, и LANG, в следующем порядке

source: * zero or more of the previous thing
ru_ru: * ноль или более от предыдущей вещи

source: * multiplication
ru_ru: * умножение

source: + one or more of the previous thing
ru_ru: + один или более от предыдущей вещи

source: + addition
ru_ru: + сложение

source: - subtraction
ru_ru: - вычитание

source: ... and run the script as F</path/to/script.pl>.
ru_ru: ... и запустить скрипт как F</path/to/script.pl>.

source: ... except inside quoted strings:
ru_ru: ... кроме внутри строки в кавычках:

source: / division
ru_ru: / деление

source: /(\d\s){3}/ three digits, each followed by a whitespace
ru_ru: /(\d\s){3}/ три цифры, за каждой из которых стоит пробел

source: /(a.)+/ matches a string in which every odd-numbered
ru_ru: /(a.)+/ соответствует строка, в которой каждый нечетный

source: /^$/ nothing in the string (start and end are
ru_ru: /^$/ ничего в строке (начало и конец

source: /^\d+/ string starts with one or more digits
ru_ru: /^\d+/ строка начинается с одной или несколькими цифрами

source: 1 p Tokenizing and parsing (with v, displays parse stack)
ru_ru: 1 p Разбор на токены или слова и парсинг (Tokenizing and parsing) (с v, отображает стек разборk)

source: 1024 x Syntax tree dump
ru_ru: 1024 x Дамп синтаксического дерева (Syntax tree dump)

source: 1048576 v Verbose: use in conjunction with other flags
ru_ru: 1048576 v Verbose (многословный): использовать в сочетании с другими флагами

source: 128 m Memory and SV allocation
ru_ru: 128 m Память и распределение SV (Scalar Value) скалярных переменных

source: 131072 T Tokenizing
ru_ru: 131072 T Разделение на слова/токены (Tokenizing)

source: 16 o Method and overloading resolution
ru_ru: 16 o Метод и разрешения перегрузки

source: 16384 X Scratchpad allocation
ru_ru: 16384 X Блокнот распределения (Scratchpad allocation)

source: 16777216 M trace smart match resolution
ru_ru: 16777216 M отслеживает умное сопоставление (trace smart match resolution)

source: 2 s Stack snapshots (with v, displays all stacks)
ru_ru: 2 s Снимок (snapshots) стека (с v, отображает все стеки)

source: 2048 u Tainting checks
ru_ru: 2048 u Проверки на разрушение

source: 2097152 C Copy On Write
ru_ru: 2097152 C Копирование при записи (Copy On Write)

source: 256 f Format processing
ru_ru: 256 f Формат обработки

source: 262144 R Include reference counts of dumped variables (eg when
ru_ru: 262144 R Включая счетчики ссылок дампинговых переменных (например, при

source: 32 c String/numeric conversions
ru_ru: 32 c Строковые/числовые преобразования

source: 32768 D Cleaning up
ru_ru: 32768 D Очистка (Cleaning up)

source: 33554432 B dump suBroutine definitions, including special Blocks
ru_ru: 33554432 B дамп подпрограммы определения, в том числе специальные блоки (dump suBroutine definitions, including special Block)

source: 4 l Context (loop) stack processing
ru_ru: 4 l Контекст (цикла) стек обработки

source: 4096 U Unofficial, User hacking (reserved for private,
ru_ru: 4096 U Неофициальный, Пользовательский хак (hacking)(зарезервирован для частного,

source: 4194304 A Consistency checks on internal structures
ru_ru: 4194304 A Проверка согласованности внутренних структур

source: 512 r Regular expression parsing and execution
ru_ru: 512 r Разбор регулярных выражений и их исполнение

source: 524288 J show s,t,P-debug (don't Jump over) on opcodes within
ru_ru: 524288 J показывает s,t,P-отладка (не выпрыгивать выше) на коды операций в оперативной памяти (show s,t,P-debug (don't Jump over) on opcodes withi)

source: 64 P Print profiling info, source file input state
ru_ru: 64 P Печатает профилирующую информацию, исходный файл входного состояния

source: 65536 S Op slab allocation
ru_ru: 65536 S Распределение оперативной памяти (Op slab allocation http://ru.wikipedia.org/wiki/Slab)

source: 8 t Trace execution
ru_ru: 8 t Трассирует выполнение

source: 8192 H Hash dump -- usurps values()
ru_ru: 8192 H Хэш дамп (Hash dump) -- узурпирует/захватывает (usurps) values()

source: 8388608 q quiet - currently only suppresses the "EXECUTING"
ru_ru: 8388608 q quiet - в настоящее время только подавляет "Запуск" ("EXECUTING")

source: < less than
ru_ru: < меньше чем

source: <= less than or equal
ru_ru: <= меньше или равно

source: = assignment
ru_ru: = присваивание

source: == equality
ru_ru: == равенство

source: =for documenting_the_underdocumented perl.h gives W/128 as PERL_UNICODE_WIDESYSCALLS "/* for Sarathy */"
ru_ru: =для документирования_поддокументов (documenting_the_underdocumented) perl.h gives W/128 as PERL_UNICODE_WIDESYSCALLS "/* for Sarathy */"

source: =for todo perltodo mentions Unicode in %ENV and filenames.
ru_ru: =для будущего (todo) perltodo упоминает Unicode в %ENV и именах файлов.

source: =head1 A basic example
ru_ru: =head1 Основной пример

source: =head1 AUTHOR
ru_ru: =head1 АВТОР

source: =head1 AVAILABILITY
ru_ru: =head1 НАЛИЧИЕ

source: =head1 BUGS
ru_ru: =head1 ОШИБКИ

source: =head1 CHANGES
ru_ru: =head1 ИЗМЕНЕНИЯ

source: =head1 DESCRIPTION
ru_ru: =head1 ОПИСАНИЕ

source: =head1 DIAGNOSTICS
ru_ru: =head1 ДИАГНОСТИКА

source: =head1 ENVIRONMENT
ru_ru: =head1 ОКРУЖЕНИЕ

source: =head1 ENVIRONMENT X<perl, environment variables>
ru_ru: =head1 ОКРУЖЕНИЕ (ENVIRONMENT) X<perl, environment variables>

source: =head1 FILES
ru_ru: =head1 ФАЙЛЫ

source: =head1 GETTING HELP
ru_ru: =head1 ПОЛУЧЕНИЕ ПОМОЩИ

source: =head1 Key naming
ru_ru: =head1 Ключевые наименования

source: =head1 NAME
ru_ru: =head1 НАЗВАНИЕ

source: =head1 NOTES
ru_ru: =head1 ПРИМЕЧАНИЯ

source: =head1 OPTIONS
ru_ru: =head1 ПАРАМЕТРЫ

source: =head1 SECURITY
ru_ru: =head1 БЕЗОПАСНОСТЬ

source: =head1 SEE ALSO
ru_ru: =head1 СМОТРИТЕ ТАКЖЕ

source: =head1 SYNOPSIS
ru_ru: =head1 СИНТАКСИС

source: =head2 "Considerations"
ru_ru: =head2 "Соображения"

source: =head2 A note on freshness
ru_ru: =head2 Замечания по обновлениям

source: =head2 Basic syntax overview
ru_ru: =head2 Основной обзор синтаксиса

source: =head2 Builtin operators and functions
ru_ru: = Head2 Встроенные операторы и функции

source: =head2 Command Switches X<perl, command switches> X<command switches>
ru_ru: =head2 Опции команды X<perl, command switches> X<command switches>

source: =head2 Conditional and looping constructs
ru_ru: =head2 Условные и циклические конструкции

source: =head2 Files and I/O
ru_ru: =head2 Файлы и Ввод/Вывод

source: =head2 Free (as in beer) books
ru_ru: =head2 бесплатно (как в пиве) книги

source: =head2 Get your book listed
ru_ru: =head2 Получение перечисленных книг

source: =head2 Internals and C Language Interface
ru_ru: =head2 Внутренности и Язык интерфейса для C

source: =head2 Language-Specific
ru_ru: =head2 Для разных языков

source: =head2 Location of Perl X<perl, location of interpreter>
ru_ru: =head2 Расположение Perl X<perl, location of interpreter>

source: =head2 Miscellaneous
ru_ru: =head2 Разное

source: =head2 OPTIONS
ru_ru: =head2 Параметры

source: =head2 Other interesting, non-Perl books
ru_ru: =head2 Другие интересные, не Perl книги

source: =head2 Overview
ru_ru: =head2 Обзор

source: =head2 Perl variable types
ru_ru: =head2 Perl типы переменных

source: =head2 Platform-Specific
ru_ru: =head2 Для отдельных платформ

source: =head2 Reference Manual
ru_ru: =head2 Справочное руководство

source: =head2 References
ru_ru: =head2 Литература

source: =head2 Regular expressions
ru_ru: =head2 Регулярные выражения

source: =head2 Running Perl programs
ru_ru: =head2 Запуск Perl программ

source: =head2 Safety net
ru_ru: =head2 Защитная сетка

source: =head2 Special Topics
ru_ru: =head2 Специальные темы

source: =head2 Stubs for Deleted Documents
ru_ru: =head2 Заглушки для удаленных документов

source: =head2 Task-Oriented
ru_ru: =head2 Задаче-ориентированные

source: =head2 The most popular books
ru_ru: =head2 Самые популярные книги

source: =head2 Tutorials
ru_ru: =head2 Учебники

source: =head2 Using Perl modules
ru_ru: =head2 Использование Perl модулей

source: =head2 Variable scoping
ru_ru: =head2 Видимость переменной

source: =head2 What is Perl?
ru_ru: =head2 Что такое Perl?

source: =head2 Writing subroutines
ru_ru: =head2 Написание подпрограмм

source: =item Arithmetic
ru_ru: =item Арифметические

source: =item Arrays
ru_ru: =item Массивы

source: =item B<-0>[I<octal/hexadecimal>] X<-0> X<$/>
ru_ru: =item B<-0>[I<восьмеричный/шестнадцатеричный>] X<-0> X<$/>

source: =item B<-L> I<language_code>
ru_ru: =item B<-L> I<код_языка>

source: =item B<-M> I<module-name>
ru_ru: =item B<-M> I<название-модуля>

source: =item B<-d> I<destination-filename>
ru_ru: =item B<-d> I<файл-назначения>

source: =item B<-m> I<module>
ru_ru: =item B<-m> I<модуль>

source: =item B<-n> I<some-formatter>
ru_ru: =item B<-n> I<форматирование>

source: =item B<-o> I<output-formatname>
ru_ru: =item B<-o> I<название-формата-вывода>

source: =item B<-v> I<perlvar>
ru_ru: =item B<-v> I<perlпеременная>

source: =item B<-w> I<option:value> or B<-w> I<option>
ru_ru: =item B<-w> I<параметр:значение> или B<-w> I<параметр> I<option>

source: =item B<PageName|ModuleName|ProgramName|URL>
ru_ru: =item B<НазваниеСтраницы|НазваниеМодуля|НазваниеПрограммы|URL>

source: =item Boolean logic
ru_ru: =item Булева логика (в честь Джорджа Була)

source: =item Hashes
ru_ru: =item Хэши

source: =item I<Automating System Administration with Perl>
ru_ru: =item I<Automating System Administration with Perl> I<Автоматизация системного администрирования с помощью Perl>

source: =item I<Data Munging with Perl>
ru_ru: =item I<Data Munging with Perl> I<Манипулирование (Munging) данными в Perl>

source: =item I<Effective Perl Programming>
ru_ru: =item I<Effective Perl Programming> I<Эффективное программирование на Perl>

source: =item I<Extending and Embedding Perl>
ru_ru: =item I<Extending and Embedding Perl> I<Расширения и встраивания Perl>

source: =item I<Higher-Order Perl>
ru_ru: =item I<Higher-Order Perl> I<Perl Высших порядков, примеры функционального программирования на Perl, там речь идет о функциях, которые могут модифицировать и производить другие функции.>

source: =item I<Intermediate Perl> (the "Alpaca Book")
ru_ru: =item I<Intermediate Perl> I<Perl на уровне среднего разработчика> ("Alpaca Book")

source: =item I<Mastering Perl>
ru_ru: =item I<Mastering Perl> I<Освоение Perl>

source: =item I<Mastering Regular Expressions>
ru_ru: =item I<Mastering Regular Expressions> I<Освоение регулярных выражений>

source: =item I<Network Programming with Perl>
ru_ru: =item I<Network Programming with Perl> I<Сетевое программирование в Perl>

source: =item I<Object Oriented Perl>
ru_ru: =item I<Object Oriented Perl> I<Объектно-ориентированный Perl>

source: =item I<Perl Best Practices>
ru_ru: =item I<Perl Best Practices> I<Perl Лучшие Практики>

source: =item I<Pro Perl Debugging>
ru_ru: =item I<Pro Perl Debugging> I<Профессиональная отладка Perl>

source: =item I<Programming Pearls>
ru_ru: =item I<Programming Pearls> I<Жемчуг программирования>

source: =item I<Programming Perl> (the "Camel Book"):
ru_ru: =item I<Программирование на Perl> ("Camel Book"):

source: =item I<Real World SQL Server Administration with Perl>
ru_ru: =item I<Real World SQL Server Administration with Perl> I<Реальный мир администрирования SQL Server с Perl>

source: =item I<Regular Expressions Cookbook>
ru_ru: =item I<Regular Expressions Cookbook> I<Книга рецептов по регулярным выражениям>

source: =item I<Writing Perl Modules for CPAN>
ru_ru: =item I<Writing Perl Modules for CPAN> I<Написание модулей Perl для CPAN>

source: =item Miscellaneous
ru_ru: =item Разное

source: =item More complex regular expressions
ru_ru: =item Более сложные регулярные выражения

source: =item Numeric comparison
ru_ru: =item Числовое сравнение

source: =item Other regexp features
ru_ru: =item Другие функции регулярных выражений

source: =item PERL_ALLOW_NON_IFS_LSP (specific to the Win32 port) X<PERL_ALLOW_NON_IFS_LSP>
ru_ru: =item PERL_ALLOW_NON_IFS_LSP (специфичные для Win32 порт) X<PERL_ALLOW_NON_IFS_LSP>

source: =item Parentheses for capturing
ru_ru: =item Скобки для захвата

source: =item SYS$LOGIN (specific to the VMS port) X<SYS$LOGIN>
ru_ru: =item SYS$LOGIN (характерные для VMS порт) X<SYS$LOGIN>

source: =item Scalars
ru_ru: =item Скаляры

source: =item Simple matching
ru_ru: = Простое совпадение

source: =item Simple substitution
ru_ru: =item Простая замена

source: =item String comparison
ru_ru: =item Сравнение строк

source: > greater than
ru_ru: > больше чем

source: >= greater than or equal
ru_ru: >= больше или равно

source: @animals[0,1]; # gives ("camel", "llama");
ru_ru: @animals[0,1]; # дает ("camel", "llama");

source: @animals[0..2]; # gives ("camel", "llama", "owl");
ru_ru: @animals[0..2]; # дает ("camel", "llama", "owl");

source: @animals[1..$#animals]; # gives all except the first element
ru_ru: @animals[1..$#animals]; # дает все, кроме первого элемента

source: A loop that tries to iterate over ARGV[0] won't find it.
ru_ru: Цикл, который пытается перебрать ARGV[0] не найдет его.

source: A number of popular modules are included with the Perl distribution itself.
ru_ru: Ряд популярных модулей уже идет в комплекте с Perl.

source: A potential problem caught by C<use strict;> will cause your code to stop immediately when it is encountered, while C<use warnings;> will merely give a warning (like the command-line switch B<-w>) and let your code run.
ru_ru: Если C<use strict;> найдет потенциальную проблема при вызове вашего кода, то выполнение немедленно остановится, когда он встречается, в то время как C<use warnings;> будет просто давать предупреждение (как параметр командной строки B<-w>), и позволит вашему коду продолжаться дальше.

source: A trailing colon suppresses the linefeed and terminator ";", allowing you to embed queries into shell commands.
ru_ru: Двоеточие подавляет перевод строки и терминатор ";", что позволяет вставлять запросы в команды оболочки (shell commands).

source: A 32 the @ARGV elements are expected to be strings encoded
ru_ru: A 32 элементы @ARGV ожидаются, как закодированные строки

source: A B<-p> overrides a B<-n> switch.
ru_ru: A B<-p> отменяет флаг B<-n>.

source: A Perl script or program consists of one or more statements.
ru_ru: Perl скрипт или программа состоит из одного или нескольких операторов.

source: A categorized list of modules is also available from CPAN.
ru_ru: Классифицированный список модулей также доступен на CPAN.
